#include "../s21_decimal.h"

/*
 *  Функция для преобразования десятичного числа в целое число типа int.
 *  @param src Десятичное число.
 *  @param dst Целочисленный результат.
 *  @return Значение ошибки преобразования.
 */
int s21_from_decimal_to_int(s21_decimal src, int *dst) {
  int conversion_result = 1;

  //  Проверяем, является ли число положительным или отрицательным.
  //  Если старший бит равен 0, то число положительное.
  if (src.bits[1] == 0 && src.bits[2] == 0) {
    // Устанавливаем значение результата равным младшему биту исходного числа.
    *dst = src.bits[0];

    // Проверяем знак числа. Если старший бит равен 1, то число отрицательное.
    int sign = !!(src.bits[3] & (1u << 31));
    // Если число отрицательное, умножаем результат на -1.
    if (sign) {
      *dst *= -1;
    }

    // Вычисляем масштаб числа, который хранится в старших битах.
    int scale = (char)(src.bits[3] >> 16);
    // Делим результат на 10 в степени, равной масштабу.
    *dst /= (int)pow(10, scale);

    conversion_result = 0;
  }

  return conversion_result;
}
